people = ["철수","철수","철수","철수","철수","철수","철수","철수","철수","철수","철수","철수","철수","철수",
"철수","철수","철수","철수","철수","철수","영희","영희","영희","영희","영희","영희","영희","민수","민수","민수","민수","민수",
"민수","민수","민수","민수","민수","민수"]

print(people)
d={}

for p in people:

    if p in d : # "철수"라는 key 가 d 라는 딕셔너리에 들어있는가.
        d[p] = d[p] + 1 # 그러면 "철수"의 갯수를 하나 늘려라.
    else : 
        d[p]=1 # 만약 "철수"가 없으면, 딕셔너리에 넣고, 벨류는 1로 만들어라.

print(d)

contries = ["usa","usa","usa","usa","usa","usa","usa","usa","usa","usa","usa","usa","korea","korea","korea","korea","korea","korea",
"korea","korea","korea","korea","korea","korea","korea","korea","korea","korea","korea","korea","korea","korea","korea","korea",
"North korea","North korea","North korea","North korea","North korea","North korea","North korea",]

h ={}
for y in contries :
    if y in h :
        h[y] = h[y]+1
    else :
        h[y] = 1

print(h)        
    

parties = ("더불어민주당","더불어민주당","더불어민주당","더불어민주당","더불어민주당","더불어민주당","더불어민주당","더불어민주당","더불어민주당","더불어민주당",
"더불어민주당","더불어민주당","더불어민주당","더불어민주당","자유한국당","자유한국당","자유한국당","자유한국당","자유한국당","자유한국당","자유한국당",
"자유한국당","자유한국당","자유한국당","자유한국당","자유한국당","자유한국당","자유한국당","미래통합당","미래통합당","미래통합당","미래통합당","미래통합당","미래통합당","미래통합당",
"미래통합당","미래통합당","미래통합당","미래통합당","미래통합당","열린우리당","열린우리당","열린우리당","열린우리당","열린우리당","열린우리당","열린우리당",
"열린우리당","열린우리당","열린우리당","열린우리당",)

a={}

for p in parties :
    if p in a :
        a[p] = a[p]+1

    else :
        a[p]=1

        print(a)